public class Main {
    public static void main(String[] args) {

        // Входные данные
        int ticket = 50;
        int amount = 20;

        // Логика программы
        int bonus = ticket / amount;
        System.out.println("Количество полученных бонусов = " + bonus);
    }
}